[LANG]
language=中文(简体)
[FONT]
font-name=Microsoft Yahei UI
welcome-text-size=64
home-text-size=24
home-section-size=26
analysis-text-size=22
analysis-section-size=24
left-panel-size=18
panel-list-size=18
panel-list-label-size=22
panel-list-header-size=18
panel-list-item-size=15
panel-button-size=14
combobox-size=18
list-combobox-size=18
checkbox-size=16
radio-size=17
elem-size=12
image-button-size=16
form-text-size=17
list-text-size=18
search-edit-size=18
message-text-size=18
setting-button-size=14
process-text-size=16
properites-title-font=20
properites-section-font=18
log-list-item-text-size=14
log-list-item-sql-size=16
[ERROR]
000000=
200001=SQL语法错误
200002=文件不存在
200003=文件损坏
200004=参数错误
200005=数据错误(Invalid Client Data)
200026=表名已重复
200027=表名不存在
200028=导入CSV文件错误，未能生成SQL，请检查CSV文件内容和配置项是否正确
300001=未选中创建索引的表字段
300002=SQL语句不能为空
300003=SQL分析仅支持SELECT查询语句
[STRING]
home=主页
database=数据库
analysis=分析
view=视图
setting=设置
items=条记录
tables=数据表
views=视图
store-procedures=存储过程
functions=函数
triggers=触发器
events=事件
columns=字段
indexes=索引
table=表
store-procedures-and-functions=存储过程和函数
clear-all=清除所有
loading=Loading...
yes=确定
no=取消
welcome-text=欢迎来到 CuteMySQL
home-text1=CuteMySQL是MySQL3的图形用户客户端（GUI）工具。
home-text2=它允许您设计、创建和浏览数据库、处理数据库对象，
home-text3=和插入数据以及设计和运行SQL查询以处理存储的数据。
home-text4=您还可以将数据库和数据从其他数据库供应商迁移到MySQL数据库。
connect-section-text=MySQL连接
connect-name=连接名称
analysis-text1=CuteMySQL允许您分析和优化SQL语句的性能。
analysis-text2=而且允许你分析数据库每张表的存储容量, 
analysis-text3=以及配置数据库的参数，来优化数据库。
perf-analysis-section-text=性能分析
error-text=系统错误:
create-connection=创建一个MySQL服务器的连接 (Ctrl+N)
manage-connections=管理MySQL服务器的连接 (Ctrl+M)
host=MySQL服务地址
username=用户名
password=密码
save-password=是否保存密码
port=端口
databases=数据库
databases-desription=(多个数据库使用';'分开，显示所有数据库请保留空.)
use-compress=使用压缩协议
read-only-connection=只读
session-idel-timeout=Session空闲超时
keep-alive-interval=Keep Alive间隔时间
default=默认
seconds=秒
connect=连接
cancel=取消
test-connect=连接测试
use-ssh-tunnel=使用SSH通道
ssh-host=SSH服务器地址
ssh-port=SSH端口
passphrase=公钥密码
save-password=保存密码
public-key=公钥(Public Key)
private-key=私钥(Private Key)
choose-password-publickey=选择密码或公钥验证
save-passphrase=保存公钥密码
use-ssl-encryption=使用SSL加密
ca-certificate=CA证书
cipher=秘钥
ssl-authentication=SSL认证
use-authentication=使用SSL认证
client-key=客户端秘钥
client-certificate=客户端证书
new-connect-name=新的连接名称
connect-success=连接成功.
connect-fail=连接失败
notice=提示
error-notice=错误提示
remove-connection-confirm=确定要删除连接吗?
remove-item-confirm=确定要删除选中项吗?
confirm=确定提示
open-file=打开
create-database=新建一个数据库 (Ctrl+N)
open-database=打开一个数据库 (Ctrl+O)
refresh=刷新(F5)
duplicate-selected-item=复制选中项. (Ctrl+D)
delete-selected-item=删除选中项.(Del)
select-connection=数据库连接
database-name=数据库名称
database-charset=数据库字符集
database-collation=数据库排序规则
create=创建
create-database-caption=创建数据库
alter-database-caption=修改数据库
not-choose-connection=请选择连接
not-choose-treeitem=请选择一项
no-database-name=请输入数据库名称
exists-database-name=数据库名称{dbName}已存在.
folder-cannot-delete=文件夹不能删除.
folder-cannot-duplicate=文件夹不能复制.
system-schema-cannot-delete=系统数据库不能删除.
system-object-cannot-delete=系统数据库的对象不能删除.
system-schema-cannot-duplicate=系统数据库不能复制.
system-object-cannot-duplicate=系统数据库的对象不能复制.
new-connection-name=新的连接名称
no-duplicate-connection-name=请输入新的连接名称.
duplicate-success=复制成功
duplicate-database=复制数据库
duplicate-table=复制数据表
duplicate-view=复制视图
duplicate-store-procedure=复制存储过程
duplicate-function=复制函数
duplicate-trigger=复制触发器
duplicate-event=复制事件
duplicate-database-description=复制选中的数据库到目标服务器。
duplicate-table-description=复制选中的数据表到目标服务器。
duplicate-view-description=复制选中的视图到目标服务器。
duplicate-store-procedure-description=复制选中的存储过程到目标服务器。
duplicate-function-description=复制选中的函数到目标服务器。
duplicate-trigger-description=复制选中的触发器到目标服务器。
duplicate-event-description=复制选中的事件到目标服务器。
source-connection=源连接
source-database=源数据库
source-objects=源对象
source-table=源数据表
source-view=源视图
source-store-procedure=源存储过程
source-function=源函数
source-trigger=源触发器
source-event=源事件
duplicate-settings=复制设置
lock-settings=导出锁设置
lock-tables=导出时锁定所有表(--lock-tables)
target-connection=目标连接
target-database=目标数据库
target-table=目标数据表
target-view=目标视图
target-store-procedure=目标存储过程
target-function=目标函数
target-trigger=目标触发器
target-event=目标事件
ddl-preview=DDL预览
no-target-database=请输入目标数据库.
exists-target-database=目标数据库已存在，请勿重复.
override-user-db=文件的数据删除后无法找回，确定是否覆盖数据库？
create-db-success-text=数据库创建成功
open-db-exists-inlist=数据库已打开，请勿重复操作
open-db-success-text=数据库打开成功
delete-user-db=确定从清单中移除选中的数据库 "{dbName}"？
delete-db-success-text=从清单中移除数据库成功
query-editor=查询编辑器
history=历史记录
history-tip=历史记录 (F8)
result-list=结果
result-info=信息
result-table-data=表数据
table-properties=表属性
exec-select-sql=执行当前选中的查询 (F9)
exec-all-sql=执行所有查询 (F10)
explain-select-sql=Explain当前选中的SQL语句 (F11)
explain-query-plan-sql=Explain query plan当前选中的SQL语句 (F12)
query-page-help=自动完成功能：[Tab]->下一个标签；[Ctrl+Space]->列出匹配的标签；[Ctrl+Enter]->列出所有的标签
no-select-userdb=未选择数据库
no-sql-statement=查询编辑器未输入SQL语句
no-sql-content=查询编辑器无SQL语句
show-form-view=显示表单视图
export-result-as=导出为... (Ctrl+Alt+E)
copy-result-data=复制数据到粘贴板
clear-all=清除所有
ok=确定
cancel=取消
export-text-description=选择导出数据的格式
csv-settings=csv选项
csv-field-settings=字段
csv-line-settings=行
csv-charset-settings=编码
excel-settings=Excel选项
sql-settings=SQL选项
export-fields-settings=选择要导出的字段
terminated-by=分隔符
enclosed-by=包含符
escaped-by=转义符
field-terminated-by=字段分隔符
field-enclosed-by=字段包含符
field-escaped-by=字段转义符
line-terminated-by=换行符
add-column-name=头部添加字段名
csv-charset=编码
excel-column-max-size=文本列大小限制
excel-decinmal-places=小数位
structure-only=仅表结构
data-only=仅数据
structure-and-data=表结构和数据
select-all=全选
un-select-all=全不选
save-to-file=导出到文件
expert-fmt-error=请选择数据导出的文件格式
terminated-by-error=请输入的“终止于”的值
enclosed-by-error=请输入“包含在”的值
escaped-by-error=请输入“转义符”的值
line-terminated-by-error=行的“终止于”的值不正确
excel-column-max-size-error=请输入“文本列大小限制”的值
excel-decinmal-places-error=请输入“小数位”的值
export-sql-error=请选择SQL选项
selected-fields-error=请选择导出的字段
export-path-error=请输入导出文件的路径
sql-notsupport-multitable-query-error=不支持多表查询和子查询的结果导出
export-success-text=导出成功，已导出{rows}行数据，是否打开文件？
open-the-file=打开文件
export-file-exists-prompt={export-path}已存在，是否替换?
limit-rows=限制行
offset=开始行
rows=行数
copy-all-rows-to-clipboard=复制所有行到粘贴板	Ctrl+Alt+A
copy-sel-rows-to-clipboard=复制选中行到粘贴板	Ctrl+Alt+H
copy-all-rows-as-sql=所有行复制为SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=选中行复制为SQL	Ctrl+Alt+K
read-only=只读
filter=筛选器 (Ctrl+Alt+F)
filter-in-use=筛选器使用中
refresh=刷新 (Ctrl+F5)
refresh-page=刷新
new-row-tip=新建一行 (Ctrl+Alt+N)
copy-row-tip=复制一行 (Ctrl+Alt+C)
save-tip=保存 (Ctrl+Alt+S)
delete-tip=删除选中行 (Ctrl+Del)
cancel-tip=撤销更改 (Ctrl+Alt+Z)
revert-tip=恢复
save=保存
revert=撤销更改
column=字段名
condition=条件
value=值
delete-confirm-text=确定删除所选行？
query=查询
result=结果
affected-rows=影响行数
exec-time=执行耗时
transfer-time=传送耗时
total-time=总耗时
connection-refresh=刷新		Ctrl+F5
connection-manage=管理连接		Ctrl+M
connection-create=新建连接		Ctrl+Shift+N
connection-delete=删除连接		Ctrl+Shift+Del
connection-export-as-sql=导出数据库到SQL	Ctrl+Shift+E
connection-import-from-sql=导入SQL到数据库	Ctrl+Shift+I
database-create=新建数据库		Ctrl+N
database-open=打开数据库		Ctrl+O
database-refresh=刷新数据库		Ctrl+R
database-delete=删除数据库		Del
database-duplicate=复制数据库为...	Ctrl+P
database-export-as-sql=导出数据库到SQL	Ctrl+E
database-import-from-sql=导入SQL到数据库	Ctrl+I
database-new=创建
database-new-table=表
database-new-view=视图
database-new-procedure=存储过程
database-new-function=函数
database-new-trigger=触发器
database-new-event=事件
export-as-sql-text-description=以SQL的方式导出选中数据库的表/视图/触发器
select-database=选中的数据库
database-objects=对象
structure-and-data-settings=结构和数据设置
insert-statement-settings=INSERT语句设置
tbl-statement-settings=数据表语句设置
retain-column-text=在“Insert Into”中保留列名
contain-multi-rows-text=每条“Insert”语句包含多行(VALUES)
retain-table-text=保留旧表(Create Table If Not Exists ...)
override-table-text=覆盖旧表 (DROP TABLE, 然后 CREATE TABLE)
import-from-sql-text-description=批量执行在SQL文件中的语句。
abort-on-error-text=出错时终止。
import-file-not-exists=导入的SQL文件不存在，请重新选择。
import-path-empty-error=导入的文件路径不能为空。
import=导入
export=导出
tbl-name=表名
new-table=创建表
new-view=创建视图
new-trigger=创建触发器
database=数据库
schema=Schema
table-columns=字段
table-indexes=索引
table-foreignkeys=外键
column-name=字段名
data-type=数据类型
default=默认
check=检查
index-name=索引名
index-type=索引类型
index-unique=Unique
partial-clause=部分子句
comments=注释
to-be-selected=待选的字段
selected=已选的字段
up=▲
down=▼
no-columns-selected=未选择字段,请选择
sql-preview=SQL预览
tbl-name-empty=表名不能为空
tbl-name-duplicated=表名已重复
create-table-success-text=表创建成功。
alter-table-success-text=表修改成功。
rename-table-success-text=表名修改成功。
delete-column-confirm-text=所选字段由一个或多个索引引用。删除此列还将修改相应的索引。确定继续删除吗？
delete-index-confirm-text=所选索引由一个或多个字段引用。删除此索引还将修改相应的字段。确定继续删除吗？
delete-confirm-text=确定继续删除吗？
new-view=创建视图
new-trigger=创建触发器
create-a-view-name=新视图名称
view-name-not-empty=新视图名称不能为空
view-name-duplicated=视图名称已重复
create-a-trigger-name=触发器名称
trigger-name-not-empty=触发器名称不能为空
trigger-name-duplicated=触发器名称已重复
execute-sql-success=SQL执行成功
copy-db-success-text=数据库复制成功
table-open=打开表数据		Alt+O
table-create=创建表		Alt+N
table-alter=修改表		Alt+A
table-rename=重命名表		Alt+M
table-truncate=清空表		Alt+T
table-drop=删除表		Alt+Del
table-copy-as=复制表到...		Alt+P
table-sharding-as=分片		Alt+G
table-export=导出表到...	Alt+E
table-import-sql=从SQL文件导入	Alt+I
table-import-csv=从CSV文件导入	Alt+J
table-manage-index=管理表索引
table-manage-foreign-key=管理表外键
properties=属性
primary-key-duplicated=主键(Primary key)重复定义。
foreignkey-name=外键名
referencing-columns=本表字段
referenced-table=外联表
referenced-columns=外联字段
on-update=On Update
on-delete=On Delete
insert-new-column=添加新字段
insert-new-index=添加新索引
insert-new-foreignkey=添加新外键
insert-del-column=删除选中字段
insert-del-index=删除选中索引
insert-del-foreignkey=删除选中外键
select-referenced-table-first=请先选择外联表
new-table-name=新表名
table-name-not-empty=新表名不能为空
table-name-duplicated=新表名已重复
ai-column-exists=自增字段(AUTOINCREMENT)已存在。
ai-fobidden-multi-pk=已有自增字段(AUTOINCREMENT)，不允许多个主键字段。
ai-column-must-integer=自增字段(AUTOINCREMENT)必须为INTEGER整数类型.
truncate-table-confirm-text=清空表后，数据不可恢复，确定清空吗？
truncate-table-success-text=成功清空数据表
drop-table-confirm-text=删除数据表后，数据不可恢复，确定删除吗？
drop-table-success-text=成功删除数据表
copy-table-text-description=配置复制参数，支持数据表分片
from-db-name=源数据库
from-tbl-name=源表
to-db-name=目标数据库
to-tbl-name=目标表
table-sharding-setttings=数据表分片
enable-table-sharding=启用数据表分片
table-suffix-begin={suffix} 开始整数
table-suffix-end={suffix} 结束整数
advanced-settings=表分片高级选项
enable-copy-data-with-strategy=启用策略，将数据复制到分片表
sharding-strategy-express-text=分表策略表达式:  {n}
preview-sql=预览SQL语句
structure-and-data-settings-unknown=结构和数据设置未选择
table-suffix-error=分片整数无效，请填写正确的值
target-table-name-no-n=目标表必须包含字符串 "{n}".
sharding-strategy-express-empty=分表策略表达式不能为空
copy-table-success-text=表复制成功。
start=开始
complete=完成
close=关闭
express-title=表分片策略表达式
functions=函数
express-editor-help=表达式 - 双击函数或字段，插入到编辑器
import-from-csv-text-description=从CSV文件导入数据的配置项
source-csv-file=源CSV文件路径
target-database=目标数据库
target-table=目标表
exists-target-table=目标数据表已存在
exists-target-object=目标对象已存在
columns-setttings=字段
csv-data=CSV 数据
column-name-on-top=第一行作为字段名
line-terminated-by=换行符
csv-null-as-keyword=null/NULL作为SQL关键字
encoding=Encoding
import-success-text=导入成功
incorrect-sql-statement=错误的SQL语句
import-error-text=导入错误
table-manage-columns=管理字段
table-drop-column=删除字段
table-manage-indexes=管理索引
table-drop-index=删除索引
show-tables=显示所有数据表
show-views=显示所有视图
show-procedures=显示所有存储过程
show-functions=显示所有函数
show-triggers=显示所有触发器
show-events=显示所有事件
create-view=创建新视图
open-view=打开视图
alter-view=更改视图
drop-view=删除视图
export-view-data=导出视图的数据
show-view-data=显示视图的数据
create-procedure=创建存储过程
open-procedure=打开存储过程
alter-procedure=更改存储过程
drop-procedure=删除存储过程
create-function=创建函数
open-function=打开函数
alter-function=更改函数
drop-function=删除函数
create-trigger=创建触发器
open-trigger=打开触发器
alter-trigger=更改触发器
drop-trigger=删除触发器
create-event=创建事件
open-event=打开事件
alter-event=更改事件
drop-event=删除事件
drop-view-confirm-text=删除视图后，视图不可恢复，确定删除吗？
drop-view-success-text=成功删除视图
drop-trigger-confirm-text=删除触发器后，触发器不可恢复，确定删除吗？
drop-trigger-success-text=成功删除触发器
sql-templates=SQL语句模板
pragma-templates=Pragmas
sql-log=SQL历史记录
clear-all=清除所有
use=使用
explain=Explain
top=置顶
untop=取消置顶
copy=复制
delete=删除
today=今天
yestoday=昨天
delete-sql-log-confirm-text=你确定要删除SQL日志吗? 
copy-to-clipboard=已复制到粘贴板
save-success-text=保存成功
delete-success-text=删除成功
data-has-changed=数据已更改，您确定要关闭页面吗？
not-save-and-close=不保存，关闭
cancel=取消关闭
table-export-as=导出数据表	Alt+E
export-as-sql-success-text=导出成功，是否打开文件？
new-query=新建查询窗口 (F7)
save-current=保存当前 (Ctrl+S)
save-all=保存所有 (Ctrl+Shift+S)
first-page=首页
prev-page=上一页
next-page=下一页
last-page=末页
save-if-data-has-changed=数据已更改，确定先保存吗？
unsort=取消排序
tab-close-this=关闭
tab-close-others=关闭非当前
tab-close-left=关闭左边所有
tab-close-right=关闭右边所有
perf-analysis=性能分析
perf-analysis-reports=分析报告
store-analysis=存储分析
db-params=数据库参数
not-select-sql=仅支持SELECT语句
open-sql-log=打开SQL日志进行性能分析 (Ctrl+L)
add-sql-analysis=输入SQL语句进行性能分析 (Ctrl+I)
sql-log-not-found=未找到SQL日志，请检查是否已删除
original-sql=原始的SQL语句
where-clause-analysis=WHERE子句分析
order-clause-analysis=ORDER子句分析
covering-index-analysis=覆盖索引分析
table-join-analysis=Joins分析
in-table=数据表
where-use-column=WHERE语句使用了字段
order-use-column=ORDER语句使用了字段
covering-index-column=WHERE和ORDER语句使用了字段
where-use-index=WHERE语句使用了索引
order-use-index=ORDER语句使用了索引
use-covering-index=使用了覆盖索引
create-index-for-performance=建议：为以下字段创建索引，能提升查询性能
hint-index-for-performance=提示：索引{hintIndexName}已覆盖包含的字段: {hintIndexColumns}
create-covering-index-for-performance=建议：为以下字段创建覆盖索引，能提升查询性能
create-index-togeger=创建索引
create-index-individ=单独创建索引
create-covering-index=创建覆盖索引
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=下面的伪代码展示查询优化器的执行过程
cycle-count=循环统计
optimize-cycle-count=提示：更改JOIN表不同的顺序，可以优化减少循环次数。
general-settings=通用设置
about=关于
language-setting=界面语言设置
change-language-restart-text=更改语言，必须重启本软件才生效。
close-and-restart=关闭重启
do-not-restart=不重启
about-us=关于我们
about-us-description=CuteMySQL由作者Xuehan Qin开发一款开源软件. 
version-info=版本
version-info-description=CuteMySQL v0.2.1 beta (64 位)
feedback=Feedback
feedback-description=If you have software issues, or have ideas and suggestions for this application, please fill out the form below to feedback us.
content-text=Content
license=Apache License Version 2.0
select-columns-analysis=Select字段分析
select-use-column=Select语句使用了以下字段
select-use-column-count=字段数
select-use-column-advice=建议：SELECT语句选择的字段超过了{maxColumns}个，尽量减少字段，能提升查询性能。
select-use-column-tips=提示：尽量减少字段，能提升查询性能。
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=存储分析:
analysis-sql=SQL分析
open-perf-report=打开报告		Alt+O
drop-perf-report=删除报告		Alt+Del
drop-perf-report-confirm-text=确定删除报告吗？
store-analysis-text=允许您分析数据库，数据表，表索引的存储容量
table-store-analysis=表 - {tblName}
index-store-analysis=索引 - {idxName} - 所属表:{tblName}
db-disk-used-title=磁盘空间利用率报告，DB路径:{dbPath}
page-size-text=页大小(单位:字节)
page-size-tips=页大小(单位:字节)
file-bytes-text=文件大小(单位:字节)
file-bytes-tips=文件大小(单位:字节)
file-pgcnt-text=整个文件中的页数(测量值)
file-pgcnt-tips=整个文件中的页数(测量值)
file-pgcnt2-text=整个文件中的页数(计算值)
file-pgcnt2-tips=整个文件中的页数(计算值)
inuse-pgcnt-text=存储数据的页数(已用)
inuse-pgcnt-tips=存储数据的页数(已用)
free-pgcnt2-text=未存储数据的页数(每个头部)
free-pgcnt2-tips=未存储数据的页数(每个头部)
free-pgcnt-text=未存储数据的页数(计算值)
free-pgcnt-tips=未存储数据的页数(计算值)
av-pgcnt-text=自动清空的页数
av-pgcnt-tips=自动清空的页数
ntable-text=数据库中的表数
ntable-tips=数据库中的表数
nindex-text=索引数
nindex-tips=索引数
nmanindex-text=定义索引数
nmanindex-tips=定义索引数
nautoindex-text=隐含索引数(自增索引)
nautoindex-tips=隐含索引数(自增索引)
user-payload-text=用户有效负载存储的字节数
user-payload-tips=用户有效负载存储的字节数
all-tbl-entrycnt-title=所有表数据量(条数)
all-tbl-idx-pagecnt-title=所有表及其索引的页数
sperate-tbl-idx-pagecnt-title=所有表和索引的页数分别计算
all-tbl-idx-report-title=所有表格和索引
total-pages-percent-text=占数据库总数的百分比
total-pages-percent-tips=占数据库总数的百分比
nentry-text=数据量(条数)
nentry-tips=数据量(条数)
storage-text=消耗的存储字节数
storage-tips=消耗的存储字节数
compressed-size-text=压缩后使用的字节数
compressed-size-tips=压缩后使用的字节数
payload-text=有效负载的字节数
payload-tips=有效负载的字节数
total-meta-text=元数据的字节数
total-meta-tips=元数据的字节数
depth-text=B树深度
depth-tips=B树深度
avg-payload-text=每条数据的平均有效载荷
avg-payload-tips=每条数据的平均有效载荷
avg-unused-text=每条数据的平均未使用字节数
avg-unused-tips=每条数据的平均未使用字节数
avg-meta-text=每条数据的平均元数据
avg-meta-tips=每条数据的平均元数据
avg-fanout-text=平均fanout数
avg-fanout-tips=平均fanout数
gap-cnt-text=非连续页面
gap-cnt-tips=非连续页面
mx-payload-text=每条数据的最大有效载荷
mx-payload-tips=每条数据的最大有效载荷
ovfl-cnt-text=已使用的溢出数据条数
ovfl-cnt-tips=已使用的溢出数据条数
int-pages-text=已使用的索引页数
int-pages-tips=已使用的索引页数
leaf-pages-text=已使用的主页数
leaf-pages-tips=已使用的主页数
ovfl-pages-text=已使用的溢出页数
ovfl-pages-tips=已使用的溢出页数
total-pages-text=已使用的总页数
total-pages-tips=已使用的总页数
int-unused-text=索引页上未使用的字节数
int-unused-tips=索引页上未使用的字节数
leaf-unused-text=主页上未使用的字节数
leaf-unused-tips=主页上未使用的字节数
ovfl-unused-text=溢出页上未使用的字节数
ovfl-unused-tips=溢出页上未使用的字节数
total-unused-text=所有页上未使用的字节数
total-unused-tips=所有页上未使用的字节数
all-table-report-title=所有表(排除索引)
all-indices-report-title=所有索引(排除表)
tbl-and-all-idx-report-title=表 {tblName} 及其所有索引
tbl-only-report-title=表 {tblName} 排除任何索引
idx-only-report-title=表 {tblName} 的所有索引
tbl-report-title=表 {tblName} 
idx-report-title=表 {tblName} 的索引 {idxName}
props-tbl-only-report-title=表 {tblName} 存储分析
props-idx-props-only-report-title=表 {tblName} 的所有索引
db-pragma-params=PRAGMA 参数
db-quick-config-params=快捷配置方案
select-pragma=PRAGMA
pragma-analysis-limit-tips=查询或更改近似分析(ANALYZE)设置的限制。这是分析(ANALYZE)命令在每个索引中检查的大致行数。
pragma-application-id-tips=用于查询或设置位于偏移量68处的32位有符号大端“Applicatioin ID”整数到数据库头中。
pragma-auto-vacuum-tips=在数据库中查询或设置自动清空状态。
pragma-automatic-index-tips=查询、设置或清除自动索引功能。
pragma-busy-timeout-tips=查询或更改忙碌超时(busy timeout)的设置。
pragma-cache-size-tips=查询或更改每个打开的数据库文件一次在内存中保留的SQLite建议的最大数据库磁盘页数。
pragma-cache-spill-tips=启用或禁用分页程序在事务中间将脏缓存页溢出到数据库文件的功能。
pragma-case-sensitive-like-tips=LIKE运算符的默认行为是忽略ASCII字符的大小写。因此，默认情况下，'a' LIKE 'A'为true。
pragma-cell-size-check-tips=在最初从磁盘读取数据库B树页面时，启用或禁用其他健全性检查。启用单元格大小检查后，可以更早地检测到数据库损坏，并且不太可能“扩散(Spread)”。
pragma-checkpoint-fullfsync-tips=查询或更改检查点操作的fullfsync标记。如果设置了此标志，则在支持F_FULLFSYNC的系统上执行检查点操作期间将使用F_FULLFSYNC同步方法。CHECKPOINT_FULLFSYNC标志的默认值为OFF。只有Mac OS-X支持F_FULLFSYNC。
pragma-collation-list-tips=返回为当前数据库连接定义的归类序列的列表。
pragma-compile-options-tips=返回构建SQLite时使用的编译时选项的名称，每行一个选项。
pragma-count-changes-tips=查询或更改计数更改标志。通常，当未设置count-changes标志时，INSERT、UPDATE和DELETE语句不返回数据。
pragma-data-store-directory-tips=查询或更改sqlite3_data_directory全局变量的值，Windows操作系统界面后端使用该变量来确定存储使用相对路径名指定的数据库文件的位置。
pragma-data-version-tips=指示数据库文件已被修改。在内存中保存数据库内容或在屏幕上显示数据库内容交互程序可以使用PRADMA data_version命令来确定它们是否需要刷新和重新加载内存或更新屏幕显示。
pragma-default-cache-size-tips=查询或设置将为每个打开的数据库文件分配的建议最大磁盘缓存页数。
pragma-defer-foreign-keys-tips=指示所有外键约束延迟到提交最外层的事务。
pragma-empty-result-callbacks-tips=查询或更改空结果回调标志。
pragma-encoding-tips=主数据库使用的文本编码，‘UTF-8’、‘UTF-16le’(小端UTF-16编码)或‘UTF-16be’(大端UTF-16编码)之一。
pragma-foreign-key-check-tips=检查数据库或表是否有违反外键约束的情况
pragma-foreign-keys-tips=查询、设置或清除外键约束的实施。
pragma-freelist-count-tips=返回数据库文件中未使用的页数。
pragma-full-column-names-tips=查询或更改full_column_names标志。
pragma-fullfsync-tips=查询或更改fullfsync标志。此标志确定是否在支持F_FULLFSYNC同步方法的系统上使用该方法。Fullfsync标志的缺省值为OFF。只有Mac OS X支持F_FULLFSYNC。
pragma-hard-heap-limit-tips=对单个进程中所有数据库连接的堆内存量施加限制。
pragma-ignore-check-constraints-tips=启用或禁用检查约束的强制。默认设置为OFF，这意味着默认情况下强制执行检查约束。
pragma-incremental-vacuum-tips=导致最多N个页面从自由列表中删除。
pragma-integrity-check-tips=对数据库执行低级格式化和一致性检查。
pragma-journal-mode-tips=查询或设置与当前数据库连接关联的数据库的日记模式。
pragma-journal-size-limit-tips=限制事务或检查点之后保留在文件系统中的回滚日志和WAL文件的大小。
pragma-legacy-alter-table-tips=设置或查询legacy_alter_table标志的值。
pragma-locking-mode-tips=设置或查询数据库连接锁定模式。锁定模式为正常模式(NORMAL)或独占模式(EXCLUSIVE)。
pragma-max-page-count-tips=查询或设置数据库文件中的最大页数。
pragma-mmap-size-tips=查询或更改为单个数据库上的内存映射I/O(memory-mapped I/O)保留的最大字节数。
pragma-module-list-tips=返回向数据库连接注册的虚拟表模块的列表。
pragma-optimize-tips=尝试优化数据库。
pragma-page-count-tips=返回数据库文件中的总页数。
pragma-page-size-tips=查询或设置数据库的页面大小。页面大小必须是介于512%和65536之间的2的幂。
pragma-parser-trace-tips=打开对SQLite内部使用的SQL解析器的跟踪。使用SQLITE_DEBUG编译时生效。
pragma-query-only-tips=防止数据库文件上的数据更改。当启用此项时，任何CREATE、REPORT、DROP、REPORT或UPDATE尝试都将导致SQLITE_READONLY错误。
pragma-quick-check-tips=对数据库执行低级格式设置和一致性检查，跳过UNIQUE和索引一致性检查。
pragma-read-uncommitted-tips=查询、设置或清除READ UNCOMMITTED隔离。
pragma-recursive-triggers-tips=查询、设置或清除触发器的递归功能。
pragma-reverse-unordered-selects-tips=启用时，该PRAGMA会导致许多没有ORDER BY子句的SELECT语句以与通常相反的顺序发出结果。
pragma-schema-version-tips=获取或设置数据库头中偏移量40处的chema-versio整数值。
pragma-secure-delete-tips=查询或更改安全删除(secure-delete)设置。
pragma-short-column-names-tips=查询或更改短字段名标志。
pragma-soft-heap-limit-tips=对单个进程中的所有数据库连接，限制占用的堆内存量。
pragma-stats-tips=返回有关表和索引的辅助信息。
pragma-synchronous-tips=查询或更改“同步(synchronous)”标志的设置。
pragma-temp-store-tips=查询或更改sqlite3_temp_directory全局变量的值，许多操作系统接口后端使用该变量来确定在何处存储临时表和索引。
pragma-threads-tips=预准备语句(prepared statement)启动协助查询的辅助线程数。
pragma-trusted-schema-tips=是否允许在schema中运行未经安全审核的 SQL 函数和虚拟表。确定是否允许视图、触发器或架构表达式（如 CHECK 约束、DEFAULT 子句、生成的字段、表达式索引和/或部分索引）运行未经安全审核的 SQL 函数和虚拟表。
pragma-user-version-tips=获取或设置数据库头中偏移量60处的user-version整数值
pragma-vdbe-addoptrace-tips=完整的VDBE操作码在代码生成期间创建时显示出来。前提是SQLite以SQLITE_DEBUG选项编译和vdbe_debug开启。
pragma-vdbe-debug-tips=开启VDBE调试，前提是SQLite以SQLITE_DEBUG选项编译
pragma-vdbe-listing-tips=在标准输出上显示完整的虚拟机操作码列表。前提是SQLite以SQLITE_DEBUG选项编译和vdbe_debug开启。
pragma-vdbe-trace-tips=在计算时在标准输出上打印虚拟机操作码。。前提是SQLite以SQLITE_DEBUG选项编译和vdbe_debug开启。
pragma-wal-autocheckpoint-tips=查询或设置预写日志(write-ahead log)/auto-checkpoint间隔。
pragma-wal-checkpoint-tips=导致数据库连接D上的数据库X的预写日志(write-ahead log)中的内容被传输到数据库文件中，并重置预写日志(write-ahead log)。
pragma-writable-schema-tips=可以使用普通的 UPDATE、INSERT 和 DELETE 语句更改sqlite_schema表。警告：滥用此编译指示很容易导致数据库文件损坏。
pragma-save-confirm=PRAGMA语句会影响数据库运行，确定执行下面的语句吗？
confirm-exec-text=确定&执行